---
type: TableData
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# TableData

`Autodesk.Revit.DB.TableData` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSectionData | — | `` |
| Method | IsEqual | — | `public bool IsEqual ( TableData OtherElem )` |
| Method | IsValidZoomLevel | 2019.2 | `public bool IsValidZoomLevel ( int zoomLevel )` |
| Property | FreezeColumnsAndRows | — | `public bool FreezeColumnsAndRows { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberOfSections | — | `public int NumberOfSections { get ; }` |
| Property | Width | — | `public double Width { get ; set ; }` |
| Property | WidthInPixels | — | `public int WidthInPixels { get ; }` |
| Property | ZoomLevel | 2019.2 | `public int ZoomLevel { get ; set ; }` |